InformationRegisters/СвязанныеРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СвязанныеРаботы</Name>
			<Comment>Связанные работы и детали для авторабот</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Авторабота</Name>
					<Comment>Авторабота</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СвязаннаяРабота</Name>
					<Comment>Связанная авторабота или номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантКомплектации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ГруппыАналогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ГруппыАналогов</Name>
			<Comment>Группы аналогов номенклатуры</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Comment>Наименование аналога</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйПоГруппе</Name>
					<Comment>Признак главного аналога для группы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйПоПроизводителю</Name>
					<Comment>Признак главного по производителю для группы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АртикулДляПоиска</Name>
					<Comment>№ номенклатуры по каталогу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторГруппы</Name>
					<Comment>Идентификатор группы аналогов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Артикул</Name>
					<Comment>№ артикула для поиска</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Comment>Производитель детали</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ГрафикРаботСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ГрафикРаботСотрудников</Name>
			<Comment>График работ сотрудников</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Comment>Вид дня</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДня</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Продолжительность</Name>
					<Comment>Продолжительность</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидИнтервала</Name>
					<Comment>Вид интервала</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыИнтервалов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоРабочегоВремени</Name>
					<Comment>Начало рабочего времени</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонецРабочегоВремени</Name>
					<Comment>Конец рабочего времени</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкаПродажиТоваровПоЮрЛицам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НастройкаПродажиТоваровПоЮрЛицам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДоговорПоставщикПокупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорПокупательПоставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОрганизацияПокупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОрганизацияПоставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПродажаЗапчастейНижеСебестоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПродажаЗапчастейНижеСебестоимости</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРемонта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Запчасть</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВидыРемонтаЦенаЗЧИРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ВидыРемонтаЦенаЗЧИРабот</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НормоЧас</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Нормочасы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРемонта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВидыРемонтаЦенаЗЧИРаботСПодразделениями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ВидыРемонтаЦенаЗЧИРаботСПодразделениями</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Нормочас</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Нормочасы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРемонта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияСлужебныхПеременных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСлужебныхПеременных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Переменная</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СлужебныеПеременные</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СлужебныеПеременные</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПраваИНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПраваИНастройки</Name>
			<Comment>Хранит права доступа и настройки окружения пользователей</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение права / настройки</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ПраваИНастройки</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект, на уровне которого производится настройка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравоНастройка</Name>
					<Comment>Право или настройка, по которой хранится значение</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПраваИНастройки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<Comment>Цены</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен, для которого хранятся цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик, историю цен которого необходимо хранить. Если &lt;пусто&gt;, то цену установили мы.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/г_Функции/Ext/Module.bsl
Функция РазложитьСтрокуВМассив(Знач Стр, Разделитель = ",") Экспорт
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции    

Процедура ОткрытьИДобавитьСвязанныеРаботы(Работа,КоличествоРабот,ЭтаФорма)   Экспорт 
	ФормаВыбора = Обработки.ПодборРабот.ПолучитьФорму("ФормаПодбораСвязанныхРабот",ЭтаФорма);
	ФормаВыбора.КоличествоРабот=КоличествоРабот;
	ФормаВыбора.ЗапускИзАРМ = Ложь;
	Если НЕ ФормаВыбора.Открыта() Тогда
		ФормаВыбора.НачальноеЗначениеВыбора=Работа;
		ФормаВыбора.РежимВыбора=Истина;
		ФормаВыбора.ОткрытьМодально();
	КонецЕсли;
КонецПроцедуры

Функция ЗаполнитьСвязанныеРаботы(НачальноеЗначениеВыбора,КоличествоРабот, ИсключатьНоменклатуру = Ложь) Экспорт 
	ВыводитьКод = Истина; ВыводитьАрт = Ложь; ВыводитьРаз = Ложь;
	#Если Клиент Тогда
		РежимВыводаКода = дкПолучитьПараметрыРежимаВыводаКодаВДокументах(,глПрава);
		ВыводитьКод = (РежимВыводаКода.Имя="КодИАртикул" ИЛИ РежимВыводаКода.Имя="Код");
		ВыводитьАрт = (РежимВыводаКода.Имя="КодИАртикул" ИЛИ РежимВыводаКода.Имя="Артикул");
		ВыводитьРаз = (ВыводитьАрт И ВыводитьКод);
	#КонецЕсли
	
	Запрос= Новый Запрос;
	
	Запрос.Текст = "
	|	ВЫБРАТЬ
	|	СвязанныеРаботы.СвязаннаяРабота КАК СвязаннаяРабота,
	|	ГруппыАналогов.ИдентификаторГруппы КАК ИдентификаторГруппы,
	|	МАКСИМУМ(СвязанныеРаботы.Количество) * &КоличествоРабот КАК Количество
	|ПОМЕСТИТЬ
	|	ТаблицаСвязанныхРабот
	|ИЗ
	|	РегистрСведений.СвязанныеРаботы КАК СвязанныеРаботы
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГруппыАналогов КАК ГруппыАналогов
	|ПО
	|	СвязанныеРаботы.СвязаннаяРабота ССЫЛКА Справочник.Номенклатура И 
	|	СвязанныеРаботы.СвязаннаяРабота.Артикул = ГруппыАналогов.Артикул
	|ГДЕ
	|	СвязанныеРаботы.Авторабота = &Авторабота //ОтборСвязаннойНоменклатуры
	|СГРУППИРОВАТЬ ПО
	|	СвязанныеРаботы.СвязаннаяРабота,
	|	ГруппыАналогов.ИдентификаторГруппы
	|;
	|
	|ВЫБРАТЬ
	|	СвязанныеРаботы.СвязаннаяРабота КАК СвязаннаяРабота,
	|	СвязанныеРаботы.СвязаннаяРабота.Наименование КАК СвязаннаяРаботаНаименование,
	|	СвязанныеРаботы.СвязаннаяРабота.НаименованиеПолное КАК СвязаннаяРаботаПредставление,
	|	СвязанныеРаботы.СвязаннаяРабота.Код КАК СвязаннаяРаботаКод,
	|	СвязанныеРаботы.СвязаннаяРабота.Артикул КАК СвязаннаяРаботаАртикул,
	|	Номенклатура.Ссылка КАК Аналог,
	|	Номенклатура.Наименование КАК АналогНаименование,
	|	Номенклатура.НаименованиеПолное КАК АналогПредставление,
	|	Номенклатура.Артикул КАК АналогАртикул,
	|	Номенклатура.Код КАК АналогКод,
	|	ВЫБОР
	|		КОГДА Номенклатура.Ссылка ЕСТЬ NULL ТОГДА ЛОЖЬ
	|		КОГДА Номенклатура.Ссылка = СвязанныеРаботы.СвязаннаяРабота ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоАналог,
	|	ХарактеристикиНоменклатуры.Ссылка КАК ХарактеристикаНоменклатуры,
	|	ХарактеристикиНоменклатуры.Наименование КАК ХарактеристикаНоменклатурыНаименование,
	|	СвязанныеРаботы.Количество КАК Количество
	|ИЗ
	|	ТаблицаСвязанныхРабот КАК СвязанныеРаботы
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГруппыАналогов КАК ГруппыАналогов
	|ПО
	|	СвязанныеРаботы.ИдентификаторГруппы = ГруппыАналогов.ИдентификаторГруппы
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|ПО
	|	ГруппыАналогов.Артикул = Номенклатура.Артикул
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ПО
	|	ВЫБОР
	|		КОГДА НЕ Номенклатура.Ссылка ЕСТЬ NULL ТОГДА
	|			Номенклатура.ТипНоменклатуры.ИспользованиеХарактеристик = 1 И 
	|			Номенклатура.ТипНоменклатуры = ХарактеристикиНоменклатуры.Владелец
	|			ИЛИ Номенклатура.ТипНоменклатуры.ИспользованиеХарактеристик = 2
	|			И Номенклатура.Ссылка = ХарактеристикиНоменклатуры.Владелец
	|		КОГДА СвязанныеРаботы.СвязаннаяРабота ССЫЛКА Справочник.Номенклатура ТОГДА
	|			(ВЫРАЗИТЬ(СвязанныеРаботы.СвязаннаяРабота КАК Справочник.Номенклатура).ТипНоменклатуры.ИспользованиеХарактеристик = 1 И 
	|			ВЫРАЗИТЬ(СвязанныеРаботы.СвязаннаяРабота КАК Справочник.Номенклатура).ТипНоменклатуры = ХарактеристикиНоменклатуры.Владелец
	|			ИЛИ ВЫРАЗИТЬ(СвязаннаяРабота КАК Справочник.Номенклатура).ТипНоменклатуры.ИспользованиеХарактеристик = 2
	|			И СвязанныеРаботы.СвязаннаяРабота = ХарактеристикиНоменклатуры.Владелец)
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|УПОРЯДОЧИТЬ ПО
	|	СвязаннаяРаботаНаименование УБЫВ,
	|	ЭтоАналог,
	|	АналогНаименование УБЫВ,
	|	ХарактеристикаНоменклатурыНаименование УБЫВ
	|ИТОГИ
	|	""<""+" + ?(ВыводитьКод, "СвязаннаяРаботаКод", "") + ?(ВыводитьРаз, "+ "" / "" +", "") + ?(ВыводитьАрт, "СвязаннаяРаботаАртикул", "" ) + "+""> "" + СвязаннаяРаботаПредставление КАК СвязаннаяРаботаПредставление,
	|	""<""+" + ?(ВыводитьКод, "АналогКод", "") + ?(ВыводитьРаз, "+ "" / "" +", "") + ?(ВыводитьАрт, "АналогАртикул", "" ) + "+""> "" + АналогПредставление КАК АналогПредставление,
	|	МАКСИМУМ(ЭтоАналог),
	|	МАКСИМУМ(Количество)
	|ПО
	|	СвязаннаяРабота,
	|	Аналог";
	
	Запрос.УстановитьПараметр("Авторабота", НачальноеЗначениеВыбора);
	Запрос.УстановитьПараметр("КоличествоРабот", ?(КоличествоРабот=0 ИЛИ КоличествоРабот = Неопределено, 1, КоличествоРабот));
	// посмотрим нужноли выбирать номенклатуру
	Если ИсключатьНоменклатуру Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"//ОтборСвязаннойНоменклатуры", " И НЕ (СвязанныеРаботы.СвязаннаяРабота ССЫЛКА Справочник.Номенклатура)");
	КонецЕсли;
	
	Результат = Новый ДеревоЗначений;
	Результат.Колонки.Добавить("Объект");
	Результат.Колонки.Добавить("Представление");
	Результат.Колонки.Добавить("ЭтоАналог", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ЭтоХарактеристика", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ВидОбъекта");
	Результат.Колонки.Добавить("Количество");
	
	ВыборкаРабот = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРабот.Следующий() Цикл
		
		СтрокаРабот = Результат.Строки.Добавить();
		СтрокаРабот.Объект        = ВыборкаРабот.СвязаннаяРабота;
		СтрокаРабот.Представление = ВыборкаРабот.СвязаннаяРаботаПредставление;
		СтрокаРабот.Количество    = ВыборкаРабот.Количество;
		СтрокаРабот.ВидОбъекта    = 1;
		
		ВыборкаАналогов = ВыборкаРабот.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаАналогов.Следующий() Цикл
			
			Выборка = ВыборкаАналогов.Выбрать(ОбходРезультатаЗапроса.Прямой);
			РодительХарактеристик = СтрокаРабот;
			Если Не ВыборкаАналогов.Аналог = Null И ВыборкаАналогов.ЭтоАналог Тогда
				СтрокаРабот.ЭтоАналог        = Истина;
				СтрокаАналогов = СтрокаРабот.Строки.Добавить();
				СтрокаАналогов.Объект        = ВыборкаАналогов.Аналог;
				СтрокаАналогов.Представление = ВыборкаАналогов.АналогПредставление;
				СтрокаАналогов.ЭтоАналог     = Истина;
				СтрокаАналогов.Количество    = ВыборкаАналогов.Количество;
				СтрокаАналогов.ВидОбъекта    = 2;
				РодительХарактеристик = СтрокаАналогов;
			КонецЕсли;
			
			Пока Выборка.Следующий() Цикл
				Если Выборка.ХарактеристикаНоменклатуры = Null Тогда
					Продолжить;
				КонецЕсли;
				Если НЕ РодительХарактеристик.ЭтоАналог Тогда
					СтрокаРабот.ЭтоХарактеристика        = Истина;
				КонецЕсли;
				СтрокаХарактеристик = РодительХарактеристик.Строки.Добавить();
				СтрокаХарактеристик.Объект            = Выборка.ХарактеристикаНоменклатуры;
				СтрокаХарактеристик.Представление     = Выборка.ХарактеристикаНоменклатурыНаименование;
				СтрокаХарактеристик.ЭтоАналог         = Выборка.ЭтоАналог;
				СтрокаХарактеристик.Количество        = Выборка.Количество;
				СтрокаХарактеристик.ВидОбъекта        = 3;
				СтрокаХарактеристик.ЭтоХарактеристика = Истина;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьВходВПрограмму ()          Экспорт 
	Если ПараметрыСеанса.Пользователь.Сотрудник<>  Справочники.Сотрудники.ПустаяСсылка()	тогда
		НаборЗаписей = РегистрыСведений.ГрафикРаботСотрудников.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Дата.Установить(ТекущаяДата()); 
		НаборЗаписей.Отбор.Сотрудник.Установить(ПараметрыСеанса.Пользователь.Сотрудник); 
		
		Если НаборЗаписей.Количество() =0 тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Дата   = ТекущаяДата(); 
			НоваяЗапись.Сотрудник =ПараметрыСеанса.Пользователь.Сотрудник; 
			НоваяЗапись.ВидДня = Перечисления.ВидДня.Рабочий; 
			НоваяЗапись.ВидИнтервала =Справочники.ВидыИнтервалов.Работа; 
			
			НаборЗаписей.Записать(); 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры	

Процедура СоздатьДокументыПерепродажиПоЮрЛицам (ТоварыКПродажи) Экспорт 
	Параметры = ПолучитьНастрокаПеремещенийМеждуЮрЛицами();
	
	Если Параметры.Количество() = 0 тогда
		Возврат ;
	КонецЕсли;
	Параметры = Параметры[0];	
	РеализацияОбъект = Документы.РеализацияТоваров.СоздатьДокумент();
	РеализацияОбъект.РегламентированныйУчет = Истина;
	РеализацияОбъект.Дата = ТекущаяДата();
	РеализацияОбъект.УстановитьНовыйНомер();
	РеализацияОбъект.ХозОперация = Справочники.ХозОперации.РеализацияТоваров;
	РеализацияОбъект.ДокументОснование = ТоварыКПродажи[0].Зн;
	РеализацияОбъект.Организация = Параметры.ОрганизацияПоставщик;
	РеализацияОбъект.ОбработкаРеквизита("Организация");
	
	РеализацияОбъект.ПодразделениеКомпании = Параметры.ПодразделениеПоставщик;
	//РеализацияОбъект.ОбработкаРеквизита("ПодразделениеКомпании");
	
	РеализацияОбъект.СкладКомпании = Параметры.СкладОтправитель;
	ДопПараметры = Новый Структура("НеРассчитыватьСкидки,ВозможностьИзмененияЦен",Истина,Ложь);
	РеализацияОбъект.ОбработкаРеквизита("СкладКомпании",,,ДопПараметры);
	
	РеализацияОбъект.ТипЦен = Параметры.ТипЦен;
	РеализацияОбъект.ОбработкаРеквизита("ТипЦен");
	
	РеализацияОбъект.ВалютаДокумента = Параметры.Валюта;
	РеализацияОбъект.ОбработкаРеквизита("ВалютаДокумента");
	
	РеализацияОбъект.Контрагент = Параметры.КонтрагентПокупатель;
	РеализацияОбъект.ОбработкаРеквизита("Контрагент");
	
	РеализацияОбъект.ДоговорВзаиморасчетов = Параметры.ДоговорПоставщикПокупатель;
	РеализацияОбъект.ОбработкаРеквизита("ДоговорВзаиморасчетов");	
	
	РеализацияОбъект.Автор = ПараметрыСеанса.Пользователь;
	РеализацияОбъект.Комментарий = "Создан автоматически для перепродажи зап. частей между организациями";
	
	
	
	Для Каждого стр из ТоварыКПродажи цикл 
		СтрокаРеализации = РеализацияОбъект.Товары.Добавить();
		СтрокаРеализации.Номенклатура = стр.Товар;
		СтрокаРеализации.Цена = стр.Цена;
		СтрокаРеализации.Количество = стр.Количество;
		СтрокаРеализации.ЕдиницаИзмерения = стр.ЕдиницаИзмерения;
		
		ДопПараметры = Новый Структура;
		
		ДопПараметры.Вставить("НеКонтролироватьЗамены",Истина);
		ДопПараметры.Вставить("ПересчитатьЦену",Ложь);
		РеализацияОбъект.ОбработкаРеквизита("Товары.Номенклатура", СтрокаРеализации,, ДопПараметры);
		СтрокаРеализации.Цена = стр.Цена;
		
		РеализацияОбъект.ОбработкаРеквизита("Товары.ХарактеристикаНоменклатуры", СтрокаРеализации,, ДопПараметры);
		РеализацияОбъект.ОбработкаРеквизита("Товары.ЕдиницаИзмерения", СтрокаРеализации,, ДопПараметры);
		РеализацияОбъект.ОбработкаРеквизита("Товары.Количество", СтрокаРеализации,, ДопПараметры);
		РеализацияОбъект.ОбработкаРеквизита("Товары.Коэффициент", СтрокаРеализации,, ДопПараметры);
		//РеализацияОбъект.ОбработкаРеквизита("Товары.Сумма", СтрокаРеализации,, ДопПараметры);
	КонецЦикла;
	Попытка
		РеализацияОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;	
	//Возврат РеализацияОбъект;
	
	ПоступлениеОбъект = Документы.ПоступлениеТоваров.СоздатьДокумент();
	//ПоступлениеОбъект.ОбработкаЗаполнения(РеализацияОбъект.Ссылка);
	
	ПоступлениеОбъект.РегламентированныйУчет = Истина;
	ПоступлениеОбъект.Дата = ТекущаяДата();
	ПоступлениеОбъект.УстановитьНовыйНомер();
	ПоступлениеОбъект.ХозОперация = Справочники.ХозОперации.ПоступлениеТоваров;
	ПоступлениеОбъект.ДокументОснование = РеализацияОбъект.Ссылка;
	
	ПоступлениеОбъект.Организация = Параметры.ОрганизацияПокупатель;
	ПоступлениеОбъект.ОбработкаРеквизита("Организация");
	ПоступлениеОбъект.ВхДокДата = РеализацияОбъект.Дата;
	ПоступлениеОбъект.ВхДокНомер = РеализацияОбъект.Номер;
	ПоступлениеОбъект.ПодразделениеКомпании = Параметры.ПодразделениеПокупатель;
	//ПоступлениеОбъект.ОбработкаРеквизита("ПодразделениеКомпании");
	
	ПоступлениеОбъект.СкладКомпании = Параметры.СкладПолучатель;
	ПоступлениеОбъект.ОбработкаРеквизита("СкладКомпании");
	
	ПоступлениеОбъект.ТипЦен = Параметры.ТипЦен;
	ПоступлениеОбъект.ОбработкаРеквизита("ТипЦен");
	
	ПоступлениеОбъект.ВалютаДокумента = Параметры.Валюта;
	ПоступлениеОбъект.ОбработкаРеквизита("ВалютаДокумента");
	
	ПоступлениеОбъект.Контрагент = Параметры.КонтрагентПоставщик;
	ПоступлениеОбъект.ОбработкаРеквизита("Контрагент");
	
	ПоступлениеОбъект.ДоговорВзаиморасчетов = Параметры.ДоговорПокупательПоставщик;
	ПоступлениеОбъект.ОбработкаРеквизита("ДоговорВзаиморасчетов");	
	
	//ПоступлениеОбъект.НеКонтролироватьЗаказПоставщику = Истина;
	//ПоступлениеОбъект.КонтролироватьЯчейкиХранения = Ложь;
	ПоступлениеОбъект.ВхДокДата  =РеализацияОбъект.Дата;
	ПоступлениеОбъект.ВхДокНомер = РеализацияОбъект.Номер;
	
	ПоступлениеОбъект.Автор = ПараметрыСеанса.Пользователь;
	ПоступлениеОбъект.Комментарий = "Создан автоматически для перепродажи зап. частей между организациями";
	Для Каждого стр из ТоварыКПродажи цикл 
		СтрокаРеализации = ПоступлениеОбъект.Товары.Добавить();
		СтрокаРеализации.Номенклатура = стр.Товар;
		СтрокаРеализации.Цена = стр.Цена;
		СтрокаРеализации.Количество = стр.Количество;
		СтрокаРеализации.ЕдиницаИзмерения = стр.ЕдиницаИзмерения;
		
		ДопПараметры = Новый Структура;
		
		ДопПараметры.Вставить("НеКонтролироватьЗамены",Истина);
		ДопПараметры.Вставить("ПересчитатьЦену",Ложь);
		ПоступлениеОбъект.ОбработкаРеквизита("Товары.Номенклатура", СтрокаРеализации,, ДопПараметры);
		СтрокаРеализации.Цена = стр.Цена;
		
		ПоступлениеОбъект.ОбработкаРеквизита("Товары.ХарактеристикаНоменклатуры", СтрокаРеализации,, ДопПараметры);
		ПоступлениеОбъект.ОбработкаРеквизита("Товары.ЕдиницаИзмерения", СтрокаРеализации,, ДопПараметры);
		ПоступлениеОбъект.ОбработкаРеквизита("Товары.Количество", СтрокаРеализации,, ДопПараметры);
		ПоступлениеОбъект.ОбработкаРеквизита("Товары.Коэффициент", СтрокаРеализации,, ДопПараметры);
		//РеализацияОбъект.ОбработкаРеквизита("Товары.Сумма", СтрокаРеализации,, ДопПараметры);
	КонецЦикла;
	
	
	Попытка
		ПоступлениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;			
КонецПроцедуры	

Функция  ПолучитьНастрокаПеремещенийМеждуЮрЛицами  () 
	Запрос = Новый Запрос;
	
	
	Запрос.Текст = "ВЫБРАТЬ
	|	НастройкаМежскладскихПеремещений.ДоговорПоставщикПокупатель,
	|	НастройкаМежскладскихПеремещений.ДоговорПокупательПоставщик,
	|	НастройкаМежскладскихПеремещений.ТипЦен,
	|	НастройкаМежскладскихПеремещений.СкладОтправитель КАК СкладОтправитель,
	|	НастройкаМежскладскихПеремещений.СкладПолучатель,
	|	НастройкаМежскладскихПеремещений.ДоговорПоставщикПокупатель.Владелец КАК КонтрагентПокупатель,
	|	НастройкаМежскладскихПеремещений.ДоговорПокупательПоставщик.Владелец КАК КонтрагентПоставщик,
	|	НастройкаМежскладскихПеремещений.ТипЦен.ВалютаЦены КАК Валюта,
	|	НастройкаМежскладскихПеремещений.СкладПолучатель.Подразделение КАК ПодразделениеПокупатель,
	|	НастройкаМежскладскихПеремещений.ОрганизацияПокупатель КАК ОрганизацияПокупатель,
	|	НастройкаМежскладскихПеремещений.СкладОтправитель.Подразделение КАК ПодразделениеПоставщик,
	|	НастройкаМежскладскихПеремещений.ОрганизацияПоставщик КАК ОрганизацияПоставщик
	|ИЗ
	|	РегистрСведений.НастройкаПродажиТоваровПоЮрЛицам КАК НастройкаМежскладскихПеремещений
	|ГДЕ
	|	НастройкаМежскладскихПеремещений.ОрганизацияПоставщик <> НастройкаМежскладскихПеремещений.ДоговорПокупательПоставщик";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
КонецФункции	

Функция г_ПоискРЛСТакимЖеНомером (НомерТел,Ссылка) Экспорт 
	
	// + КМ
	// БЫЛО:
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	РабочийЛист.Ссылка
	//|ИЗ
	//|	Документ.РабочийЛист КАК РабочийЛист
	//|ГДЕ
	//|	РабочийЛист.ПредставлениеТелефона = &ПредставлениеТелефона
	//|	И РабочийЛист.Ссылка <> &Ссылка
	//|	И РабочийЛист.ПометкаУдаления = ЛОЖЬ";
	//ЗАпрос.УстановитьПараметр("ПредставлениеТелефона",НомерТел);	
	//ЗАпрос.УстановитьПараметр("Ссылка",Ссылка);	
	////ЗАпрос.УстановитьПараметр("Статус",Справочники.СтатусыРабочегоЛиста.Сделка);	
	//
	// СТАЛО:
	ОсновнойТелефон = "";
	ДобавочныйТелефон = "";
	
	Если Найти(НомерТел, ", доб.") > 0 Тогда 	// есть добавочный номер
		ОсновнойТелефон = "%" + СокрЛП(Лев(НомерТел, Найти(НомерТел, ", доб.") - 1)) + "%";
		ДобавочныйТелефон = "%" + СокрЛП(Сред(НомерТел, Найти(НомерТел, ", доб.") + 6)) + "%";
	Иначе
		ОсновнойТелефон = "%" + СокрЛП(НомерТел) + "%";
		ДобавочныйТелефон = "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РабочийЛист.Ссылка
	|ИЗ
	|	Документ.РабочийЛист КАК РабочийЛист
	|ГДЕ
	|	(РабочийЛист.ПредставлениеТелефона ПОДОБНО &ОсновнойТелефон
	|			ИЛИ ВЫБОР
	|				КОГДА &ДобавочныйТелефон <> """"
	|					ТОГДА РабочийЛист.ПредставлениеТелефона ПОДОБНО &ДобавочныйТелефон
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|	И РабочийЛист.Ссылка <> &Ссылка
	|	И РабочийЛист.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ОсновнойТелефон", ОсновнойТелефон);	
	Запрос.УстановитьПараметр("ДобавочныйТелефон", ДобавочныйТелефон);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);	
	// - КМ
	
	СписокРЛ = Новый СписокЗначений;
	
	Результат = Запрос.Выполнить().Выбрать();
	
	ПОка Результат.Следующий() цикл
		СписокРЛ.Добавить(Результат.Ссылка);
		
	КонецЦикла;	
	
	Возврат СписокРЛ;
КонецФункции

Процедура ПроставитьЯчейкиВНоменклатуре (Документ) Экспорт 
	Если ТипЗнч(Документ) <> Тип("ДокументСсылка.ПеремещениеТоваров")   тогда
		
		
		Для Каждого стр из Документ.Товары цикл
			Если стр.Ячейка <> Справочники.ЯчейкиХранения.ПустаяСсылка() тогда
				//Для Каждого ячейки из стр.ЯчейкиХранения цикл
				Номенклатура = стр.Номенклатура.ПолучитьОбъект();
				НайденнаяСтрока = Номенклатура.ЯчейкиХранения.Найти(Документ.СкладКомпании, "СкладКомпании");
				Если НайденнаяСтрока = Неопределено тогда
					СтрокаЯчейки = Номенклатура.ЯчейкиХранения.Добавить();
					СтрокаЯчейки.СкладКомпании = Документ.СкладКомпании;
					СтрокаЯчейки.ЯчейкаХранения = стр.Ячейка;
					
				Иначе
					//НайденнаяСтрока = Номенклатура.ЯчейкиХранения.Найти(стр.Ячейка, "ЯчейкаХранения");
					Номенклатура.ЯчейкиХранения.Удалить(НайденнаяСтрока);
					СтрокаЯчейки = Номенклатура.ЯчейкиХранения.Добавить();
					СтрокаЯчейки.СкладКомпании = Документ.СкладКомпании;
					СтрокаЯчейки.ЯчейкаХранения = стр.Ячейка;
				КонецЕсли;   
				Попытка
					Номенклатура.Записать();
				Исключение
				КонецПопытки;
				//КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого стр из Документ.Товары цикл
			Если стр.ЯчейкаПолучатель <> Справочники.ЯчейкиХранения.ПустаяСсылка() тогда
				//Для Каждого ячейки из стр.ЯчейкиХранения цикл
				Номенклатура = стр.Номенклатура.ПолучитьОбъект();
				НайденнаяСтрока = Номенклатура.ЯчейкиХранения.Найти(Документ.СкладКомпании, "СкладКомпании");
				Если НайденнаяСтрока = Неопределено тогда
					СтрокаЯчейки = Номенклатура.ЯчейкиХранения.Добавить();
					СтрокаЯчейки.СкладКомпании = Документ.СкладКомпании;
					СтрокаЯчейки.ЯчейкаХранения = стр.ЯчейкаПолучатель;
					
				Иначе
					//НайденнаяСтрока = Номенклатура.ЯчейкиХранения.Найти(стр.Ячейка, "ЯчейкаХранения");
					Номенклатура.ЯчейкиХранения.Удалить(НайденнаяСтрока);
					СтрокаЯчейки = Номенклатура.ЯчейкиХранения.Добавить();
					СтрокаЯчейки.СкладКомпании = Документ.СкладКомпании;
					СтрокаЯчейки.ЯчейкаХранения = стр.ЯчейкаПолучатель;
				КонецЕсли;   
				Попытка
					Номенклатура.Записать();
				Исключение
				КонецПопытки;
				//КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры	

Функция ВыгрузитьДеревоЗначенийВТаблицуЗначений(Дерево, Таблица = Неопределено) Экспорт
	
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл  //Перебираем все строкидерева значений используя рекурсию и формируем такие же в таблице значений
		ЗаполнитьЗначенияСвойств(Таблица.Добавить(), СтрокаДерева); 
		ВыгрузитьДеревоЗначенийВТаблицуЗначений(СтрокаДерева, Таблица);
	КонецЦикла;    
	Возврат Таблица;
	
КонецФункции

Функция  ЗапускПреодразованияДереваВТаблицуЗначений (Дерево) Экспорт 
	
	ТЗ = Новый ТаблицаЗначений;  //Создаем таблицу значений
	Для Каждого Колонка Из Дерево.Колонки Цикл //Перебираем все колонки дерева значений и формируем такие же в таблице значений
		ТЗ.Колонки.Добавить(Колонка.Имя);
	КонецЦикла;
	
	
	ТЗ = ВыгрузитьДеревоЗначенийВТаблицуЗначений (Дерево, ТЗ);
	
	Возврат ТЗ;
КонецФункции

Функция ПолучитьЗЧПоПродажениеНижеСебестоимости (ВидРемонта)  Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПродажаЗапчастейНижеСебестоимости.Запчасть
	|ИЗ
	|	РегистрСведений.ПродажаЗапчастейНижеСебестоимости КАК ПродажаЗапчастейНижеСебестоимости
	|ГДЕ
	|	ПродажаЗапчастейНижеСебестоимости.ВидРемонта = &ВидРемонта";
	Запрос.УстановитьПараметр("ВидРемонта",ВидРемонта);			  
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции	

Функция ПолучитьЦенуРаботЗапастей (ВидРемонта) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВидыРемонтаЦенаЗЧИРабот.НормоЧас,
	|	ВидыРемонтаЦенаЗЧИРабот.ТипЦен
	|ИЗ
	|	РегистрСведений.ВидыРемонтаЦенаЗЧИРабот КАК ВидыРемонтаЦенаЗЧИРабот
	|ГДЕ
	|	ВидыРемонтаЦенаЗЧИРабот.ВидРемонта = &ВидРемонта";
	Запрос.УстановитьПараметр("ВидРемонта",ВидРемонта);			 
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 0 тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат;
	КонецЕсли;	
	
КонецФункции 

//Бондаренко++ 20241015
Функция ПолучитьЦенуРаботЗапастейСПодразделениями(ВидРемонта,ПодразделениеКомпании) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыРемонтаЦенаЗЧИРабот.Нормочас КАК Нормочас,
	               |	ВидыРемонтаЦенаЗЧИРабот.ТипЦен КАК ТипЦен
	               |ИЗ
	               |	РегистрСведений.ВидыРемонтаЦенаЗЧИРаботСПодразделениями КАК ВидыРемонтаЦенаЗЧИРабот
	               |ГДЕ
	               |	ВидыРемонтаЦенаЗЧИРабот.ВидРемонта = &ВидРемонта
	               |	И ВидыРемонтаЦенаЗЧИРабот.Подразделение = &ПодразделениеКомпании";
	
	Запрос.УстановитьПараметр("ВидРемонта",ВидРемонта);
	Запрос.УстановитьПараметр("ПодразделениеКомпании",ПодразделениеКомпании);			 
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 0 тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат;
	КонецЕсли;	
	
КонецФункции
//Бондаренко-- 20241015

// функция по получению значения служебной переменной
Функция ПолучитьЗначениеСлужебнойПеременной(Переменная, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	// вернём, если ничего не найдём
	//прВернуть = ЗначениеПоУмолчанию;
	// в запросе получаем значение переменной
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСлужебныхПеременных.Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСлужебныхПеременных КАК ЗначенияСлужебныхПеременных
	|ГДЕ
	|	ЗначенияСлужебныхПеременных.Переменная = &Переменная";
	
	Запрос.УстановитьПараметр("Переменная", Переменная);
	
	Результат = Запрос.Выполнить().Выгрузить();
	//	// если запрос что-то вернул, то это и есть значение переменной
	//Если Результат.Следующий() Тогда
	//	прВернуть = Результат.Значение;
	//КонецЕсли;
	//
	Возврат Результат;
	
КонецФункции	

Функция ПолучитьСписокПользователейДляНапоминанийВПеремещенииАвто (Ссылка)Экспорт 
	Подразделение = ?( ТипЗнч(Ссылка.СкладПолучатель) = Тип("СправочникСсылка.СкладыКомпании"),Ссылка.СкладПолучатель.Подразделение,Ссылка.СкладПолучатель).Родитель;
	Должности =   ПолучитьЗначениеСлужебнойПеременной(ПланыВидовХарактеристик.СлужебныеПеременные.Должность);
	Пользователи = Новый СписокЗначений;
	Если Должности.Количество()>0 тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Пользователи.Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	НЕ Пользователи.ЯвляетсяШаблоном
		|	И НЕ Пользователи.Сотрудник.ФлагУволен
		|	И Пользователи.Сотрудник.Должность В(&Должность)
		|	И Пользователи.Подразделение В ИЕРАРХИИ(&Подразделение)";
		Запрос.УстановитьПараметр("Должность",Должности.ВыгрузитьКолонку("Значение"));
		Запрос.УстановитьПараметр("Подразделение",Подразделение);	
		
		Результат = Запрос.Выполнить().Выгрузить();
		Пользователи = Результат;
		//Если Результат.Количество() > 0 тогда
		//	Для Каждого стр из Результат цикл
		//		Пользователи.Добавить(стр.Ссылка);
		//КонецЦикла;	
		//КонецЕсли;	
		
		
	КонецЕсли;	
	
	Возврат Пользователи;
КонецФункции	

Функция ПолучитьПользователейСПравом (Право) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПраваИНастройки.Объект
	               |ИЗ
	               |	РегистрСведений.ПраваИНастройки КАК ПраваИНастройки
	               |ГДЕ
	               |	ПраваИНастройки.Значение = ИСТИНА
	               |	И ПраваИНастройки.ПравоНастройка = &ПравоНастройка
	               |	И ПраваИНастройки.Объект.ЯвляетсяШаблоном = ЛОЖЬ
	               |	И ПраваИНастройки.Объект.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ПравоНастройка",Право);			   
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции	

Функция ПолучитьЦену  (Номенклатура, ДатаЗапроса, ТипЦен) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЦеныСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних(
	|			&ТекДата,
	|			Номенклатура = &Номенклатура
	|				И ТипЦен = &ТипЦен) КАК ЦеныСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Цена";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ТекДата",ДатаЗапроса);
	Запрос.УстановитьПараметр("ТипЦен",ТипЦен);
	
	Резуьтат = Запрос.Выполнить().Выбрать();
	Цена = 0 ;
	Если Резуьтат.Следующий() тогда
		Цена = Резуьтат.Цена;
		
	КонецЕсли;
	
	Возврат Цена;
КонецФункции	

Функция ПечатьСкладскихДокументов (ТекОбъект) Экспорт 
	#Если Клиент Тогда
		ЕСли ТекОбъект.Проведен тогда
			
			Если  ТипЗнч(ТекОбъект) = Тип("ДокументОбъект.ПеремещениеТоваровВПроизводство") тогда
				Режим = РежимДиалогаВопрос.ДаНет;
				Ответ = Вопрос("Печатать документ", Режим, 0);
				Если Ответ = КодВозвратаДиалога.Да Тогда
					ТекОбъект.Печать(, , Истина,);
					
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	#КонецЕсли
	
КонецФункции	

Функция  ПроверкаНаНеЗакрытыеИзвлечения(Ссылка) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ИзвлечениеТоваровИзПроизводства.Ссылка
	|ИЗ
	|	Документ.ИзвлечениеТоваровИзПроизводства КАК ИзвлечениеТоваровИзПроизводства
	|ГДЕ
	|	ИзвлечениеТоваровИзПроизводства.ПометкаУдаления = ЛОЖЬ
	|	И ИзвлечениеТоваровИзПроизводства.Проведен = ЛОЖЬ
	|	И ИзвлечениеТоваровИзПроизводства.ДокументОснование = &ДокументОснование";
	Запрос.УстановитьПараметр("ДокументОснование",Ссылка);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Количество()>0 тогда
		Возврат Истина;
	ИНаче
		Возврат Ложь;
	КонецЕсли;
КонецФункции	

Функция ПолучитьVIN (стр,Разделитель = " ")    Экспорт 
	МассивСтрок = Новый Массив();
	НазначениПалтежаБезРазделителей = СтрЗаменить(стр," ","");
	
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Прервать;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Прервать;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	Если Константы.ДилерскийЦентр.Получить() = Справочники.ДилерскиеЦентры.Дельта тогда
		Флаг = Ложь;
		Для Каждого стр из МассивСтрок цикл
			ВИН = ЛЕВ( стр	,3);
			//ВИН2 = ЛЕВ( стр	,4);
			
			//Решетка =  ЛЕВ( стр	,1);
			//АМ1 = ЛЕВ( стр	,3);
			//АМ2 =  ЛЕВ( стр	,3);
			//VIN = "";
			//ЕСли НРег(VIN)<> "vin" или   Решетка  <>"#"     тогда
			//	
			//	Продолжить;
			//КонецЕсли;	 
			Если Флаг тогда
				VIN = стр;
				Прервать;
			КонецЕсли;	
			ЕСЛИ  НРег(ВИН)= "vin" тогда
				ДлиннаVIN = СтрДлина(стр);
				VIN = Прав(стр,ДлиннаVIN-3);
				VIN=СтрЗаменить(VIN," ","");
				VIN=СтрЗаменить(VIN,",","");
				Если  НРег(VIN) = "vin" тогда
					Флаг = Истина;	
							Иначе
							Возврат VIn;

				КонецЕсли;
				Продолжить;
			Иначе
				Продолжить;
				
			КонецЕсли;	
			Возврат VIn;
		КонецЦикла;	
		
	ИначеЕсли     Константы.ДилерскийЦентр.Получить() = Справочники.ДилерскиеЦентры.Олимп тогда
		Для Каждого стр из МассивСтрок цикл
			ВИН = ЛЕВ( стр	,3);
			ВИН2 = ЛЕВ( стр	,4);
			
			Решетка =  ЛЕВ( стр	,1);
			АМ1 = ЛЕВ( стр	,3);
			АМ2 =  ЛЕВ( стр	,3);
			VIN = "";
			//ЕСли НРег(VIN)<> "vin" или   Решетка  <>"#"     тогда
			//	
			//	Продолжить;
			//КонецЕсли;	 
			ЕСЛИ  НРег(ВИН2)= "vin:" тогда
				ДлиннаVIN = СтрДлина(стр);
				VIN = Прав(стр,ДлиннаVIN-4);
				VIN=СтрЗаменить(VIN," ","");
				VIN=СтрЗаменить(VIN,",","");
				
			ИначеЕСЛИ  НРег(ВИН)= "vin" тогда
				ДлиннаVIN = СтрДлина(стр);
				VIN = Прав(стр,ДлиннаVIN-3);
				VIN=СтрЗаменить(VIN," ","");
				VIN=СтрЗаменить(VIN,",","");
			ИначеЕсли    Решетка  ="#" тогда
				ДлиннаVIN = СтрДлина(стр);
				VIN = Прав(стр,ДлиннаVIN-1);
				VIN=СтрЗаменить(VIN," ","");
				VIN=СтрЗаменить(VIN,",","");
				
			ИначеЕсли   АМ1  ="а/м" тогда
				ДлиннаVIN = СтрДлина(стр);
				VIN = Прав(стр,ДлиннаVIN-3);
				VIN=СтрЗаменить(VIN," ","");
				VIN=СтрЗаменить(VIN,",","");
				
				
				
			ИначеЕсли    АМ2  ="а\м:" тогда
				ДлиннаVIN = СтрДлина(стр);
				VIN = Прав(стр,ДлиннаVIN-3);
				VIN=СтрЗаменить(VIN," ","");
				VIN=СтрЗаменить(VIN,",","");
				
				
				
			ИначеЕсли VIN = "" тогда
				
				Продолжить;
				
			КонецЕсли;	
			
			Если VIN = "" тогда
				
				Продолжить;
				
			КонецЕсли;	
			Если VIN = "" или найти("0123456789",VIN)=0 тогда
				АМ1  ="а\м:"; 
				Поз = Найти(НРег(НазначениПалтежаБезРазделителей),АМ1);
				Если Поз>0 Тогда
					Vin =  Сред(НазначениПалтежаБезРазделителей,Поз+4);
					ДлиннаVIN = СтрДлина(VIN);
					VIN = Лев(VIN,7);
					Возврат VIn;
				КонецЕсли;	
				АМ1  ="а/м:"; 
				Поз = Найти(НРег(НазначениПалтежаБезРазделителей),АМ1);
				Если Поз>0 Тогда
					Vin =  Сред(НазначениПалтежаБезРазделителей,Поз+4);
					ДлиннаVIN = СтрДлина(VIN);
					VIN = Лев(VIN,7);
					Возврат VIn;
				КонецЕсли;	
			КонецЕсли;	
			
			Возврат VIn;
		КонецЦикла;	
		
		
	Иначе
		НазначениПалтежаБезРазделителей = СтрЗаменить(НазначениПалтежаБезРазделителей," ","");
		АМ1  ="а/м:"; 
		Поз = Найти(НРег(НазначениПалтежаБезРазделителей),АМ1);
		Если Поз>0 Тогда
			Vin =  Сред(НазначениПалтежаБезРазделителей,Поз+5);
			ДлиннаVIN = СтрДлина(VIN);
			VIN = Лев(VIN,7);
			Возврат VIn;
			
		КонецЕсли;
		АМ1  ="а/м:"; 
		Поз = Найти(НРег(НазначениПалтежаБезРазделителей),АМ1);
		Если Поз>0 Тогда
			Vin =  Сред(НазначениПалтежаБезРазделителей,Поз+5);
			ДлиннаVIN = СтрДлина(VIN);
			VIN = Лев(VIN,7);
			Возврат VIn;
			
		КонецЕсли;
		АМ1  ="а/м"; 
		Поз = Найти(НРег(НазначениПалтежаБезРазделителей),АМ1);
		Если Поз>0 Тогда
			Vin =  Сред(НазначениПалтежаБезРазделителей,Поз+4);
			ДлиннаVIN = СтрДлина(VIN);
			VIN = Лев(VIN,7);
			Возврат VIn;
			
		КонецЕсли;
		АМ1  ="а/м"; 
		Поз = Найти(НРег(НазначениПалтежаБезРазделителей),АМ1);
		Если Поз>0 Тогда
			Vin =  Сред(НазначениПалтежаБезРазделителей,Поз+4);
			ДлиннаVIN = СтрДлина(VIN);
			VIN = Лев(VIN,7);
			Возврат VIn;
			
		КонецЕсли;
		
		АМ1  ="vin"; 
		Поз = Найти(НРег(НазначениПалтежаБезРазделителей),АМ1);
		Если Поз>0 Тогда
			Vin =  Сред(НазначениПалтежаБезРазделителей,Поз+17);
			ДлиннаVIN = СтрДлина(VIN);
			VIN = Лев(VIN,8);
			Возврат VIn;
		КонецЕсли;	
		
		
		
		
	КонецЕсли;
	
	
	Возврат Неопределено;
	
	
КонецФункции	

Процедура ЗавершитьВыдачу(СотрудникАвторизирован)  Экспорт 
	// проверим наличие открытых интервалов
	ВыполяетсяАвторабота = Справочники.Автоработы.ПустаяСсылка();
	Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
	
	
	//Если Автоработы.Найти(Справочники.Автоработы.ВыдачаЗЧ,"Авторабота")<>Неопределено  тогда
	ВыполяетсяАвторабота =  Справочники.Автоработы.ВыдачаЗЧ;
	//Запрос = НОвый Запрос;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РегистрацияВремениСотрудника.Период КАК Период,
	|	РегистрацияВремениСотрудника.Сотрудник КАК Сотрудник,
	|	РегистрацияВремениСотрудника.ВидОтметки КАК ВидОтметки,
	|	РегистрацияВремениСотрудника.КонецРаботы КАК КонецРаботы,
	|	РегистрацияВремениСотрудника.Продолжительность КАК Продолжительность,
	|	РАЗНОСТЬДАТ(РегистрацияВремениСотрудника.Период, &ТекДата, МИНУТА) / 60 КАК Часы,
	|	РегистрацияВремениСотрудника.Авторабота
	|ИЗ
	|	РегистрСведений.РегистрацияВремениРаботТехПроцесс КАК РегистрацияВремениСотрудника
	|ГДЕ
	|	РегистрацияВремениСотрудника.ВидОтметки = &Работа
	|	И РегистрацияВремениСотрудника.КонецРаботы = &ПустаяДата
	|	И РегистрацияВремениСотрудника.Продолжительность = 0
	|	И РегистрацияВремениСотрудника.КонецРаботы = &ПустаяДата
	|	И РегистрацияВремениСотрудника.Период МЕЖДУ &НАчПериода И &КонПериода
	|	И РегистрацияВремениСотрудника.ЗаказНаряд = &ЗаказНаряд
	|	И РегистрацияВремениСотрудника.Авторабота = &Авторабота";
	
	Запрос.УстановитьПараметр("ЗаказНаряд"  , СотрудникАвторизирован);
	Запрос.УстановитьПараметр("Авторабота"  ,ВыполяетсяАвторабота);
	
	Запрос.УстановитьПараметр("ТекДата"  , ТекущаяДата());
	Запрос.УстановитьПараметр("Работа"     , Справочники.ВидыОтметокВремени.Работа);
	Запрос.УстановитьПараметр("ПустаяДата" , Дата("00010101"));
	Запрос.УстановитьПараметр("НАчПериода"  , НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("КонПериода"  , КонецДня(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если Не РезультатЗапроса.Следующий() тогда
		//Предупреждение("Выдача не начаналась");
		Возврат
		
	КонецЕсли;	
	
	СтрокаЗапроса =  РезультатЗапроса;
	СтрокаЗапроса.Сбросить();
	Попытка
		ПОка СтрокаЗапроса.Следующий() цикл 
			
			
			МенеджерЗаписи = РегистрыСведений.РегистрацияВремениРаботТехПроцесс.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период    = СтрокаЗапроса.Период;
			МенеджерЗаписи.ЗаказНаряд = СотрудникАвторизирован;
			МенеджерЗаписи.Сотрудник = СтрокаЗапроса.Сотрудник;
			МенеджерЗаписи.Авторабота =  СтрокаЗапроса.Авторабота;
			
			МенеджерЗаписи.ВидОтметки= Справочники.ВидыОтметокВремени.Работа;
			
			МенеджерЗаписи.Продолжительность= СтрокаЗапроса.Часы;
			МенеджерЗаписи.КонецРаботы= ТекущаяДата();
			
			МенеджерЗаписи.Записать(Истина);
		КонецЦикла;
	Исключение
	КонецПопытки;
КонецПроцедуры

Функция ПолучитьАвтоработыПоВидуРемонта (ВидРемонта, Авторабота)  Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "";
	
	
	
КонецФункции	


Процедура ЗаписатьУпушеныйСпрос(ТекСтрока,ФормаДок) Экспорт 
	ТекСтрока = ФормаДок.ЭлементыФормы.Товары.ТекущаяСтрока;
	Если   ТипЗнч(ФормаДок.ДокументОбъект) = Тип("ДокументОбъект.ЗаказНаряд") или
		ТипЗнч(ФормаДок.ДокументОбъект) = Тип("ДокументОбъект.ЗаявкаНаРемонт") или
		ТипЗнч(ФормаДок.ДокументОбъект) = Тип("ОбработкаОбъект.АРМКалькуляция")  или
		ТипЗнч(ФормаДок.ДокументОбъект) = Тип("ОбработкаОбъект.АРМКорзина")    тогда
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		// Данный фрагмент построен конструктором.
		// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ОстаткиТоваровОрдерныйСкладОстатки.КоличествоОстаток, 0) КАК Остаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровОрдерныйСклад.Остатки КАК ОстаткиТоваровОрдерныйСкладОстатки
		|ГДЕ
		|	ОстаткиТоваровОрдерныйСкладОстатки.Номенклатура = &Номенклатура";
		Запрос.УстановитьПараметр("Номенклатура",ТекСтрока.Номенклатура);
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		ЕСЛИ НЕ ВыборкаДетальныеЗаписи.Следующий() ТОгда
			Возврат ;
		КонецЕсли;;
		
		//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		
		ФормаСпроса = Обработки.УпущенныйСпрос.ПолучитьФорму("ФормаСпроса",ФормаДок);
		Если ТекСтрока<>Неопределено И (Не ТекСтрока.Номенклатура.ЭтоГруппа) Тогда
			ФормаСпроса.Артикул=ТекСтрока.Номенклатура.Артикул;
			ФормаСпроса.Номенклатура=ТекСтрока.Номенклатура;
		КонецЕсли;
		ФормаСпроса.Количество=1;
		ФормаСпроса.ВладелецФормы = ФормаДок;
		ФормаСпроса.ОткрытьМодально();
	КонецЕсли;
КонецПроцедуры	


Процедура СоздатьИОтпраитьЭлПисьмо(мКому,МКопия, Тема, Тело,Основание) Экспорт 
	ЭлПисьмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
	ЭлПисьмо.ОтправительПредставление = "Альфа авто <1c@sokolmotors.ru>" ;
	//Для Каждого стр из мКому цикл
	//	ЭлПисьмо.ПолучателиПредставление =  ЭлПисьмо.ПолучателиПредставление +?( ЭлПисьмо.ПолучателиПредставление="",стр,";"+стр); 
	//КонецЦикла;  
	//Для Каждого стр из МКопия цикл
	//	ЭлПисьмо.КопииПредставление =  ЭлПисьмо.КопииПредставление +?( ЭлПисьмо.КопииПредставление="",стр,";"+стр); 
	//КонецЦикла;
	Для Каждого стр из мКому цикл
		СтрокаПолуатели = ЭлПисьмо.Получатели.Добавить();
		СтрокаПолуатели.АдресЭлектроннойПочты=стр;
		СтрокаПолуатели.Представление=стр;
		СтрокаПолуатели.КодГруппыАдреса             =Перечисления.КодГруппыАдресаЭлектронногоПисьма.Кому ;
		ЭлПисьмо.ПолучателиПредставление =  ЭлПисьмо.ПолучателиПредставление +?( ЭлПисьмо.ПолучателиПредставление="",стр,";"+стр); 
		
	КонецЦикла;
	ЭлПисьмо.Тема = Тема;
	ЭлПисьмо.ТекстПисьма= Тело;
	ЭлПисьмо.ДокументОснование = Основание;
	ЭлПисьмо.УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.Альфа;
	ЭлПисьмо.ГруппаПисем = Справочники.ГруппыПисемЭлектроннойПочты.НайтиПоНаименованию("Исходящие");
	ЭлПисьмо.Важность = Перечисления.Важность.Высокая;
	//ЭлПисьмо.ДатаОтправления =ТекущаяДата();
	ЭлПисьмо.Дата = ТекущаяДата()  ;
	ЭлПисьмо.ХозОперация = Справочники.ХозОперации.ЭлектронноеПисьмо;
	ЭлПисьмо.УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.Альфа;	
	ЭлПисьмо.Организация =   ПараметрыСеанса.Пользователь.Организация;
	ЭлПисьмо.ПодразделениеКомпании = ПараметрыСеанса.Пользователь.Подразделение;
	ЭлПисьмо.Автор   = ПараметрыСеанса.Пользователь;
	ЭлПисьмо.ФорматТекста = Перечисления.ФорматТекста.ПростойТекст; 
	ЭлПисьмо.Записать();
	СтруктураРежимовОбмена = Новый Структура("Получить, Отправить", Ложь, Истина);
	СоединениеСПочтовымСервером = эпПодключитьсяКПочтовомуСерверу(ЭлПисьмо.УчетнаяЗапись, СтруктураРежимовОбмена);
	Если СоединениеСПочтовымСервером <> Неопределено Тогда
		Если эпОтправитьПисьмо(ЭлПисьмо.ЭтотОбъект, СоединениеСПочтовымСервером) Тогда
			эпОтключитьсяОтПочтовогоСервера(СоединениеСПочтовымСервером);
			//Закрыть();
		Иначе
			эпОтключитьсяОтПочтовогоСервера(СоединениеСПочтовымСервером);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры	


Функция ПолучитьПользователейДляРассылки (Подразделение,ТипРассылки,ИсточникРассылки) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РассылкаПочты.Сотрудники
	|ПОМЕСТИТЬ ВТСотрудники
	|ИЗ
	|	РегистрСведений.РассылкаПочты КАК РассылкаПочты
	|ГДЕ
	|	РассылкаПочты.Подразделение В Иерархии (&Подразделение)
	|	И РассылкаПочты.ТипРассылки В (&ТипРассылки)
	|	И РассылкаПочты.ИсточникРассылки = &ИсточникРассылки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.Объект В
	|			(ВЫБРАТЬ
	|				ВТСотрудники.Сотрудники
	|			ИЗ
	|				ВТСотрудники КАК ВТСотрудники)";
	
	Запрос.УстановитьПараметр("ИсточникРассылки", ИсточникРассылки);
	Запрос.УстановитьПараметр("Подразделение", Подразделение.Родитель);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("ТипРассылки", ТипРассылки);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Представление");
	
КонецФункции	

Функция ПолучитьВыполнениеПриемки (Документ) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РегистрацияВремениРаботТехПроцесс.Период,
	|	РегистрацияВремениРаботТехПроцесс.Сотрудник,
	|	РегистрацияВремениРаботТехПроцесс.ЗаказНаряд,
	|	РегистрацияВремениРаботТехПроцесс.Авторабота,
	|	РегистрацияВремениРаботТехПроцесс.ВидОтметки,
	|	РегистрацияВремениРаботТехПроцесс.КонецРаботы,
	|	РегистрацияВремениРаботТехПроцесс.Продолжительность,
	|	РегистрацияВремениРаботТехПроцесс.РабочееМесто
	|ИЗ
	|	РегистрСведений.РегистрацияВремениРаботТехПроцесс КАК РегистрацияВремениРаботТехПроцесс
	|ГДЕ
	|	РегистрацияВремениРаботТехПроцесс.ЗаказНаряд.Автомобиль = &Автомобиль
	|	И РегистрацияВремениРаботТехПроцесс.Авторабота = &Авторабота
	|	И РегистрацияВремениРаботТехПроцесс.Период МЕЖДУ &ДатаНачало И &ДатаОкончания";
	Запрос.УстановитьПараметр("Авторабота",Справочники.Автоработы.Приемка);				 
	Запрос.УстановитьПараметр("Автомобиль",Документ.Ссылка.Автомобиль);	
	Запрос.УстановитьПараметр("ДатаНачало",   НачалоДня(?(Документ.Ссылка.ДатаНачала='00010101',ТекущаяДата(),Документ.Ссылка.ДатаНачала)));	
	
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(?(Документ.Ссылка.ДатаНачала='00010101',ТекущаяДата(),Документ.Ссылка.ДатаНачала)));	
	
	
	
	Результат = Запрос.Выполнить().Выбрать();
	Если  Результат.Следующий() тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;	
КонецФункции	

Функция ПолучитьСписокВыбораВидовРемонта (Элемент,Права,ОбъектДокумент) Экспорт 
 	
 	СЗ_ЗапрещенныхВидовРемонта = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗапрещенныеВидыРемонта.Пользователь,
	|	ЗапрещенныеВидыРемонта.ВидРемонта
	|ИЗ
	|	РегистрСведений.ЗапрещенныеВидыРемонта КАК ЗапрещенныеВидыРемонта
	|ГДЕ
	|	ЗапрещенныеВидыРемонта.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.Пользователь);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СЗ_ЗапрещенныхВидовРемонта.Добавить(ВыборкаДетальныеЗаписи.ВидРемонта);
	КонецЦикла;
	
	//Бондаренко++ 20220209_
	Если НЕ ( РольДоступна("ПолныеПрава") ИЛИ РольДоступна("СМ_КассирОформитель") ИЛИ РольДоступна("СМ_АудиторСервиса") ) Тогда
		СЗ_ЗапрещенныхВидовРемонта.Добавить(Справочники.ВидыРемонта.ДополнительноеОборудование);		
		СЗ_ЗапрещенныхВидовРемонта.Добавить(Справочники.ВидыРемонта.ДопОборудованиеСогласованноеСДилером);		
	КонецЕсли;

	Если НЕ ( РольДоступна("ПолныеПрава") ИЛИ РольДоступна("СМ_КассирОформитель") ) Тогда
 		СЗ_ЗапрещенныхВидовРемонта.Добавить(Справочники.ВидыРемонта.ДополнительноеОборудованиеСубподряд);		
	КонецЕсли;              
	//Бондаренко-- 20220209_
	
	//Бондаренко++ 20220411
	АвтоЕстьНаСкладе = Ложь;
	АвтоЕстьНаСкладе = СМГ_АвтоЕстьНаСкладе(ОбъектДокумент);
	Если НЕ АвтоЕстьНаСкладе Тогда
		//СЗ_ЗапрещенныхВидовРемонта.Добавить(Справочники.ВидыРемонта.ГарантияПроизводителя);	
		СЗ_ЗапрещенныхВидовРемонта.Добавить(Справочники.ВидыРемонта.РемонтБуАвтомобиля);	
		СЗ_ЗапрещенныхВидовРемонта.Добавить(Справочники.ВидыРемонта.ПредпродажнаяПодготовка);	
 		Если СЗ_ЗапрещенныхВидовРемонта.НайтиПоЗначению(Справочники.ВидыРемонта.ДополнительноеОборудование) = Неопределено Тогда
			СЗ_ЗапрещенныхВидовРемонта.Добавить(Справочники.ВидыРемонта.ДополнительноеОборудование);	  					
 		КонецЕсли;
		Если СЗ_ЗапрещенныхВидовРемонта.НайтиПоЗначению(Справочники.ВидыРемонта.ДопОборудованиеСогласованноеСДилером) = Неопределено Тогда
			СЗ_ЗапрещенныхВидовРемонта.Добавить(Справочники.ВидыРемонта.ДопОборудованиеСогласованноеСДилером);	  					
 		КонецЕсли;
		Если СЗ_ЗапрещенныхВидовРемонта.НайтиПоЗначению(Справочники.ВидыРемонта.ДополнительноеОборудованиеСубподряд) = Неопределено Тогда
			СЗ_ЗапрещенныхВидовРемонта.Добавить(Справочники.ВидыРемонта.ДополнительноеОборудованиеСубподряд);	  					
		КонецЕсли;
		СЗ_ЗапрещенныхВидовРемонта.Добавить(Справочники.ВидыРемонта.РемонтДляОпМКЦ);	
		//Бондаренко++ 20221108
		СЗ_ЗапрещенныхВидовРемонта.Добавить(Справочники.ВидыРемонта.РемонтДляОпДО);	
		//Бондаренко-- 20221108
		СЗ_ЗапрещенныхВидовРемонта.Добавить(Справочники.ВидыРемонта.Детейлинг);	
 	КонецЕсли;
	//Бондаренко-- 20220411
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыРемонта.Ссылка
	|ИЗ
	|	Справочник.ВидыРемонта КАК ВидыРемонта
	|ГДЕ
	|	НЕ ВидыРемонта.ПометкаУдаления
	|	И НЕ ВидыРемонта.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.Служебный)
	|	И НЕ ВидыРемонта.Ссылка В (&СЗ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыРемонта.Наименование";
	Запрос.УстановитьПараметр("СЗ",СЗ_ЗапрещенныхВидовРемонта);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
 	
КонецФункции  

//Бондаренко++ 20220411
Функция СМГ_АвтоЕстьНаСкладе(ОбъектДокумент)
	
	ЕстьНаСкладе = Истина;
	
 	Попытка
		КонтрагентСтаричков = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН","262804044870");
	Исключение
		КонтрагентСтаричков = Справочники.Контрагенты.ПустаяСсылка();
	КонецПопытки;
	
	Если Не обЗначениеНеЗаполнено(КонтрагентСтаричков) Тогда	
		Если Не обЗначениеНеЗаполнено(ОбъектДокумент.Контрагент) Тогда
			Если ОбъектДокумент.Контрагент = КонтрагентСтаричков Тогда
				Возврат ЕстьНаСкладе;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	Если обЗначениеНеЗаполнено(ОбъектДокумент.Автомобиль) Тогда
		Возврат ЕстьНаСкладе;	
	КонецЕсли;
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ОстаткиАвтомобилейОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(&ТекущаяДата, Автомобиль = &Автомобиль) КАК ОстаткиАвтомобилейОстатки";
	
	Если обЗначениеНеЗаполнено(ОбъектДокумент.Дата) Тогда
		Запрос.Параметры.Вставить("ТекущаяДата", ТекущаяДата());
	Иначе	
		Запрос.Параметры.Вставить("ТекущаяДата", ОбъектДокумент.Дата);
	КонецЕсли; 
	
	Запрос.Параметры.Вставить("Автомобиль", ОбъектДокумент.Автомобиль);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
 	Если Результат[0].КоличествоОстаток > 0 Тогда
		ЕстьНаСкладе = Истина;
	Иначе
 		ЕстьНаСкладе = Ложь;
	КонецЕсли;               
	
	Возврат ЕстьНаСкладе;
 	
КонецФункции // СМГ_АвтоЕстьНаСкладе(ОбъектДокумент)
//Бондаренко-- 20220411

// Холышевская ++ 16.07.2026
Функция УбыточныеАвтоЕстьНаСкладе(АвтомобильСсылка, ОбъектДокумент) Экспорт
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ОстаткиАвтомобилейОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(&ТекущаяДата, Автомобиль = &Автомобиль) КАК ОстаткиАвтомобилейОстатки";
	
	Если обЗначениеНеЗаполнено(ОбъектДокумент.Дата) Тогда
		Запрос.Параметры.Вставить("ТекущаяДата", ТекущаяДата());
	Иначе	
		Запрос.Параметры.Вставить("ТекущаяДата", ОбъектДокумент.Дата);
	КонецЕсли; 
	
	Запрос.Параметры.Вставить("Автомобиль", АвтомобильСсылка);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ЕстьНаСкладе = Ложь;
 	Если Результат[0].КоличествоОстаток > 0 Тогда
		ЕстьНаСкладе = Истина;
	Иначе
 		ЕстьНаСкладе = Ложь;
	КонецЕсли;               
	
	Возврат ЕстьНаСкладе;
 	
КонецФункции
// Холышевская ++ 16.07.2026

// Холышевская ++ 09.07.2026 убыточные организации
Функция ПроверитьВидАвтоДляУбыточныхОрганизаций(АвтомобильСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвтомобилиСрезПоследних.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
		|ГДЕ
		|	АвтомобилиСрезПоследних.Значение В(&СписокДляСрезаПоследних)
		|	И АвтомобилиСрезПоследних.Автомобиль = &Автомобиль
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Автомобили.Значение
		|ИЗ
		|	РегистрСведений.Автомобили КАК Автомобили
		|ГДЕ
		|	Автомобили.Значение В(&СписокДляВсегоРегистра)
		|	И Автомобили.Автомобиль = &Автомобиль";
	
	// авто никогда не должен был быть подменным и тестовым
	СписокДляВсегоРегистра = Новый СписокЗначений;
	СписокДляВсегоРегистра.Добавить(Перечисления.ВидАвтомобиля.ТестовыйАвтомобиль);
	СписокДляВсегоРегистра.Добавить(Перечисления.ВидАвтомобиля.ПодменныйАвтомобиль);
	
	// авто на данный момент не должен быть новым, паралленым импортом, корпоративной квотой 
	СписокДляСрезаПоследних = Новый СписокЗначений;
	СписокДляСрезаПоследних.Добавить(Перечисления.ВидАвтомобиля.Новый);
	СписокДляСрезаПоследних.Добавить(Перечисления.ВидАвтомобиля.ПараллельныйИмпорт);
	СписокДляСрезаПоследних.Добавить(Перечисления.ВидАвтомобиля.КорпоративнаяКвота);
	СписокДляСрезаПоследних.Добавить(Перечисления.ВидАвтомобиля.СобственныйПарк);
	
	Запрос.УстановитьПараметр("Автомобиль", АвтомобильСсылка);
	Запрос.УстановитьПараметр("СписокДляВсегоРегистра", СписокДляВсегоРегистра);
	Запрос.УстановитьПараметр("СписокДляСрезаПоследних", СписокДляСрезаПоследних);
	
	РезультатЗапроса = Запрос.Выполнить();
		
	Если РезультатЗапроса.Пустой() тогда
		Возврат Истина
	Иначе
		Возврат ложь;
	КонецЕсли;
	 
КонецФункции
// Холышевская -- 09.07.2026

// Холышевская ++ 27.08.2026
Функция ПолучитьТекстЗапросаДляВычисленияСебестоимостиАвтомобиля() Экспорт
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата КАК ДатаПоступления,
		|	ПоступлениеАвтомобилейАвтомобили.СуммаВсего КАК СуммаВсего,
		|	ПоступлениеАвтомобилейАвтомобили.СтавкаНДС КАК СтавкаНДС,
		|	ПоступлениеАвтомобилейАвтомобили.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ Поступление
		|ИЗ
		|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
		|ГДЕ
		|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен
		|	И ПоступлениеАвтомобилейАвтомобили.АвтомобильБУ
		|	И ПоступлениеАвтомобилейАвтомобили.Автомобиль = &Автомобиль
		|	И (ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент.ФормаСобственности В (&ЧастноеЛицо)
		|			ИЛИ ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент.НашаФирма)
		|	И ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата < &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Поступление.ДатаПоступления КАК ДатаПоступления,
		|	Поступление.СуммаВсего КАК СуммаВсего,
		|	Поступление.СтавкаНДС КАК СтавкаНДС,
		|	Поступление.Ссылка КАК Ссылка,
		|	СУММА(ЕСТЬNULL(ОстаткиАвтомобилейОбороты.СуммаПриход, 0)) КАК СуммаПриход,
		|	СУММА(ЕСТЬNULL(ОстаткиАвтомобилейОбороты.СуммаРасход, 0)) КАК СуммаРасход
		|ПОМЕСТИТЬ Итог
		|ИЗ
		|	Поступление КАК Поступление
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей.Обороты(, &КонецПериода, Регистратор, Автомобиль = &Автомобиль) КАК ОстаткиАвтомобилейОбороты
		|		ПО Поступление.Ссылка = ОстаткиАвтомобилейОбороты.Партия
		|			И (ОстаткиАвтомобилейОбороты.Регистратор ССЫЛКА Документ.КорректировкаПоступленияАвтомобилей)
		|
		|СГРУППИРОВАТЬ ПО
		|	Поступление.ДатаПоступления,
		|	Поступление.СуммаВсего,
		|	Поступление.СтавкаНДС,
		|	Поступление.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Итог.Ссылка КАК Ссылка,
		|	Итог.ДатаПоступления КАК ДатаПоступления,
		|	Итог.СуммаВсего КАК СуммаВсего,
		|	Итог.СтавкаНДС КАК СтавкаНДС,
		|	Итог.СуммаПриход КАК СуммаПриход,
		|	Итог.СуммаРасход КАК СуммаРасход,
		|	Итог.СуммаВсего + Итог.СуммаПриход - Итог.СуммаРасход КАК Себестоимость
		|ИЗ
		|	Итог КАК Итог
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПоступления УБЫВ";
	
	Возврат ТекстЗапроса;	
КонецФункции
// Холышевская -- 27.08.2026

// Холышевская ++ 02.09.2026
Функция ПолучитьЗарегестрированноеПодраздлениеПоДЦ(Организация, ДилерскийЦентр) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияКомпании.Ссылка КАК ПодразделениеКомпании
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|ГДЕ
		|	ПодразделенияКомпании.ОПЗарегистрировано
		|	И ПодразделенияКомпании.ДилерскийЦентр = &ДилерскийЦентр
		|	И ПодразделенияКомпании.Организация = &Организация";
	
	Запрос.УстановитьПараметр("ДилерскийЦентр", ДилерскийЦентр);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат ВыборкаДетальныеЗаписи.ПодразделениеКомпании;
		КонецЦикла;
	
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции
// Холышевская -- 02.09.2026

Функция  ПолучитьУчастниковСобытияПоКладовщикам(Должность,Подразделения) Экспорт 
	
	Кладовщики =   ПолучитьЗначениеСлужебнойПеременной(ПланыВидовХарактеристик.СлужебныеПеременные.Кладовщики);
	
КонецФункции	

Функция ПолучитьEmail(Контрагент) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	КонтактнаяИнформация.Представление
				   |ИЗ
				   |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
				   |ГДЕ
				   |	КонтактнаяИнформация.Объект = &Объект
				   |	И КонтактнаяИнформация.Тип = &Тип";
	Запрос.УстановитьПараметр("Объект",Контрагент);
	Запрос.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);      
	
	Резултат = Запрос.Выполнить().Выбрать();
	Если Резултат.Следующий() тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;

	КонецЕсли;
КонецФункции

Функция MD5Строка(тСтрока)   Экспорт
   Crypt = Новый COMОбъект("System.Security.Cryptography.MD5CryptoServiceProvider");
   Text = Новый COMОбъект("System.Text.UTF8Encoding");
 
   HashArray = Crypt.ComputeHash_2(Text.GetBytes_4(тСтрока)).Выгрузить();
 
   Hash = "";
   Для Каждого Число Из HashArray Цикл
      Hash = Hash + DecToHex(Число);
   КонецЦикла;
 
   Возврат Hash;
КонецФункции

Функция DecToHex(Знач Число)
   тЧисло = Число;
   тБаза = 16;
 
   Пока тЧисло <> 0 Цикл
      тПоз =тЧисло % тБаза;
      Результат = Сред("0123456789abcdef", тПоз + 1, 1) + Результат;
      тЧисло = Цел(тЧисло / тБаза);
   КонецЦикла;
 
   Если Число < тБаза Тогда 
      Результат = "0" + Результат; 
   КонецЕсли;
 
   Возврат Результат;
КонецФункции

Функция СозадатьКонтрагентаИЗСтроки(Ссылка,документ) Экспорт 
			Контрагент = Справочники.Контрагенты.СоздатьЭлемент();
			ФИО = г_Функции.РазложитьСтрокуВМассив(Ссылка," ");
			Контрагент.УстановитьНовыйКод();
			Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо;
			Контрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель;
			Если ФИО.Количество() =1 тогда
				Контрагент.Имя = ФИО[0];	
			Иначе	
				Контрагент.Фамилия = ФИО[0];
				Попытка
					Контрагент.Имя = ФИО[1];	
				Исключение
				КонецПопытки;
				Попытка
					Контрагент.Отчество = ФИО[2];
				Исключение
				КонецПопытки;	
			КонецЕсли;		
			Контрагент.ЭтотОбъект.ОбменДанными.Загрузка = Истина;
			Контрагент.Автор =   ПараметрыСеанса.Пользователь;
			Контрагент.ДатаРегистрации = ТекущаяДата();
			Контрагент.Наименование = СокрЛП(Контрагент.Фамилия + ?(обЗначениеНеЗаполнено(Контрагент.Фамилия),""," ") + Контрагент.Имя + ?(обЗначениеНеЗаполнено(Контрагент.Имя),""," ") + Контрагент.Отчество);
			Контрагент.НаименованиеПолное = СокрЛП(Контрагент.Фамилия + ?(обЗначениеНеЗаполнено(Контрагент.Фамилия),""," ") + Контрагент.Имя + ?(обЗначениеНеЗаполнено(Контрагент.Имя),""," ") + Контрагент.Отчество);
			Контрагент.Родитель = Справочники.Контрагенты.Покупатели;
			Если ТипЗнч(Контрагент) <> Тип("ДокументСсылка.Событие") Тогда
	       		Контрагент.ОсновнойТелефон = документ.ПредставлениеТелефона;
			ИначеЕсли ТипЗнч(Контрагент) <> Тип("ДокументСсылка.РабочийЛист") Тогда
 				Контрагент.ПредставлениеТелефона = документ.ПредставлениеТелефона;
	 
			КонецЕсли;	 
			Контрагент.Записать();

			Возврат Контрагент.Ссылка;
	
	   КонецФункции	
		
Функция ПреобразоватьУИвСТроку(УИ) Экспорт 
	Возврат СтрЗаменить(Строка(УИ),"-","");	
КонецФункции			


Функция ПреобразоватьСтрокаВУИ(УИ) Экспорт 
		Первый = Лев(УИ,8);
	Пятый = Прав(УИ,12);
	
	УИ = СтрЗаменить(УИ,Первый,"");
	УИ = СтрЗаменить(УИ,Пятый,"");
	
	Второй = Лев(УИ,4);
	Четвертый = Прав(УИ,4);
	
	УИ = СтрЗаменить(УИ,Второй,"");
	УИ = СтрЗаменить(УИ,Четвертый,"");
	
	Третий = 	УИ;
	Возврат Первый+"-"+Второй+"-"+Третий+"-"+Четвертый+"-"+Пятый;	
КонецФункции			

Функция УбратьЛинииСимволыИзТелефон(Имя) Экспорт 
	  Имя = СтрЗаменить(Имя," ",""); 
	  Имя = СтрЗаменить(Имя,"(",""); 
	  Имя = СтрЗаменить(Имя,")",""); 
	  Имя = СтрЗаменить(Имя,"-",""); 
	  //Имя = СтрЗаменить(Имя,"+",""); 
	  Возврат Имя;
	
КонецФункции	

Функция ПреобразоватьТелефонВФормат1с (Телефон) Экспорт 
	 Телефон = УбратьЛинииСимволыИзТелефон(Телефон);
	 Если СтрДлина(Телефон) = 11 тогда
		 Телефон = "+7"+ Прав(Телефон,10);
	 Иначе
		 Телефон = Телефон;
	 КонецЕсли;	 
	 
	 Возврат Телефон;
КонецФункции	
   //Бондаренко++ 20190502
  
 // Процедура обработчик события ОбработкаПроведения Документа
// Параметры:
//	Источник - источник события
//	Отказ - флаг отказа
//
Процедура ДокументОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Возврат; //Бондаренко++-- 20190606
	
	СуммаНДСисточника = 0;
	
	Попытка
		СуммаНДСисточника = Источник.СуммаНДС;
 	Исключение
		//
	КонецПопытки; 
	
	Если СуммаНДСисточника = 0 Тогда
		#Если Клиент Тогда
			//Сообщить("У документа: "+Источник+" сумма НДС = 0");
		#КонецЕсли 
		Возврат;
	КонецЕсли;
	
 	#Если Клиент Тогда
	Попытка
		//Сообщить("Источник: "+Источник);
 	Исключение
		//	
	КонецПопытки;  
	#КонецЕсли 
	Если Источник.СуммаНДС > 0 Тогда
 	#Если Клиент Тогда
		Попытка
			//Сообщить("Источник.СуммаНДС: "+Источник.СуммаНДС);
 		Исключение
			//	
		КонецПопытки;  
	#КонецЕсли 
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если ТипЗНЧ(Источник.Ссылка)=Тип("ДокументСсылка.РеализацияАвтомобилей") ИЛИ
		 ТипЗНЧ(Источник.Ссылка)=Тип("ДокументСсылка.РеализацияТоваров") Тогда
		СчетФактура = Документы.СчетФактураВыданный.СоздатьДокумент();
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданный.Ссылка
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.ДокументОснование = &ДокументОснование";
 	КонецЕсли;
 	
	Запрос.УстановитьПараметр("ДокументОснование", Источник.Ссылка);
	
 	РезультатЗапроса = Запрос.Выполнить();
	
 	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
 	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СчетФактура = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	КонецЦикла;
	
 	СчетФактура.ОбработкаЗаполнения(Источник.Ссылка);
  	
	Попытка
		СчетФактура.Записать(РежимЗаписиДокумента.Запись);
		Попытка
			СчетФактура.Записать(РежимЗаписиДокумента.Проведение);
 		Исключение
 	 	#Если Клиент Тогда
 			Сообщить("ОШИБКА! Документ '"+СчетФактура+"' не удалось провести.",СтатусСообщения.ОченьВажное);
	  	#КонецЕсли 
 		КонецПопытки;
 	Исключение
	 	#Если Клиент Тогда
 			Сообщить("ОШИБКА! Документ '"+СчетФактура+"' не удалось записать.",СтатусСообщения.ОченьВажное);
	  	#КонецЕсли 
  	КонецПопытки;

КонецПроцедуры

Процедура ДокументОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	Возврат; //Бондаренко++-- 20190606
	
	#Если Клиент Тогда
 	//	Сообщить("Внимание! Счет-фактура от источника: "+Источник+" снимается с проведения...");
	#КонецЕсли 
	
	Запрос = Новый Запрос;
	
	Если ТипЗНЧ(Источник.Ссылка)=Тип("ДокументСсылка.РеализацияАвтомобилей") ИЛИ 
		 ТипЗНЧ(Источник.Ссылка)=Тип("ДокументСсылка.РеализацияТоваров") Тогда
 		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданный.Ссылка
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.ДокументОснование = &ДокументОснование";
  	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДокументОснование", Источник.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СчетФактура = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Попытка
			СчетФактура.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Исключение
			#Если Клиент Тогда
				Сообщить("ОШИБКА! Документ '"+СчетФактура+"' не удалось снять с проведения.",СтатусСообщения.ОченьВажное);
			#КонецЕсли 
		КонецПопытки; 
	КонецЦикла;
	
КонецПроцедуры

//Бондаренко-- 20190502
